function About() {
  return (
    <section className="flex items-center bg-gray-300 darkModeTop min-h-[calc(100dvh-11.5dvh)] font-poppins  ">
      <div className="justify-center flex-1 max-w-6xl py-4 mx-auto lg:py-6 md:px-6">
        <div className="flex flex-wrap ">
          <div className="w-full px-4 mb-10 lg:w-1/2 lg:mb-0">
            <img
              src="/image/Steam.bmp"
              alt=""
              className="relative z-40 object-cover w-full h-96 rounded-3xl"
            />
          </div>
          <div className="w-full px-4 mb-10 lg:w-1/2 lg:mb-0 " dir="rtl">
            <h2 className="mb-4 text-4xl font-semibold text-blue-500 darkModeTop">
              درباره یی ما بدانید
            </h2>
            <p className="mb-10 text-lg leading-7 text-gray-800 darkModeTop">
              برخی روزهداران دختران خود را که قصد روزه گرفتن دارند به این بهانه
              که هنوز بچه هستند از این کار باز میدارند، در حالی که ممکن است آن
              دختر به سن عادت ماهیانه و بلوغ رسیده باشد بدون آنکه از وی در این
              باره سوال کنند .شیخ ابن جبرین ـ رحمه الله ـ میگوید« :بسیاری از
              دختران در سن ده یا یازده سالگی عادت ماهیانهشان آغاز میشود اما
              خانوادهشان در این مورد سهلانگاری میکنند و آنان را کودک به حساب
              میآورند و ملزم به روزه نمیکنند که این کار اشتباه است زیرا دختر
              وقتی به سن عادت ماهیانه رسید بالغ شده و احکام تکلیف بر وی جاری
              میشود» (فتاوی الصیام). اشتباهی که برخی روزهداران مرتکب میشوند این
              است که در حال روزه استفاده از مسواک را مشکلدار میدانند و شاید گمان
              کنند این کار روزه را باطل میکند .اما این درست نیست بلکه رسول الله
              ـ صلی الله علیه وسلم ـ میفرماید:« اگر باعث سختگیری بر امتم نمیشدم
              دستور میدادم هنگام هر نماز مسواک بزنند» (متفق علیه.) امام بخاری
              میگوید: «پیامبر ـ علیه الصلاة و السلام ـ روزهدار را از دیگران
              استثنا نکردهاند» و شیخ ابن عثیمین ـ رحمه الله ـ میگوید:« روزهی
              روزهدار با مسواک باطل نمیشود، بلکه این کار برای او و دیگران در هر
              وقت روز یا شب سنت است» .
            </p>
          </div>
        </div>
      </div>
    </section>
  );
}

export default About;
